In [2]:
#Load dependencies
import numpy as np
import pandas as pd
#import pandas_profiling as pdp
import matplotlib.pyplot as plt
import seaborn as sns
# This line tells the notebook to show plots inside of the notebook
%matplotlib inline

In [4]:
file=r"D:\EXCELL\Flight_Data.csv"
df = pd.read_csv(file, encoding = 'unicode_escape')

C:\Users\admin\AppData\Local\Temp\ipykernel_15436\2016872835.py:2: DtypeWarning: Columns (11,12) have mixed types. Specify dtype option on import or set low_memory=False.
  df = pd.read_csv(file, encoding = 'unicode_escape')

In [5]:
df.head(5)

,Unnamed: 0,airline,flight,source_city,departure_time,stops,arrival_time,destination_city,class,duration,days_left,price,date
0,0,SpiceJet,SG-8709,Delhi,Evening,zero,Night,Mumbai,Economy,2.17,1,5953,01-01-2018
1,1,SpiceJet,SG-8157,Delhi,Early_Morning,zero,Morning,Mumbai,Economy,2.33,1,5953,02-01-2018
2,2,AirAsia,I5-764,Delhi,Early_Morning,zero,Early_Morning,Mumbai,Economy,2.17,1,5956,03-01-2018
3,3,Vistara,UK-995,Delhi,Morning,zero,Afternoon,Mumbai,Economy,2.25,1,5955,04-01-2018
4,4,Vistara,UK-963,Delhi,Morning,zero,Morning,Mumbai,Economy,2.33,1,5955,05-01-2018

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 301206 entries, 0 to 301205
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Unnamed: 0        301206 non-null  int64
 1   airline           300754 non-null  object
 2   flight            301206 non-null  object
 3   source_city       301206 non-null  object
 4   departure_time    301206 non-null  object
 5   stops             301206 non-null  object
 6   arrival_time      301206 non-null  object
 7   destination_city  301206 non-null  object
 8   class             301006 non-null  object
 9   duration          300956 non-null  float64
 10  days_left         301206 non-null  int64
 11  price             301106 non-null  object
 12  date              358 non-null     object
dtypes: float64(1), int64(2), object(10)
memory usage: 29.9+ MB

In [7]:
df.tail()

,Unnamed: 0,airline,flight,source_city,departure_time,stops,arrival_time,destination_city,class,duration,days_left,price,date
301201,1300218,Vistara,UK-747,Delhi,Early_Morning,one,Night,Mumbai,Economy,113.83,1,14985,15-03-2018
301202,1300219,Air_India,AI-512,Delhi,Afternoon,one,Night,Mumbai,Economy,97.58,1,14670,16-03-2018
301203,1300220,Air_India,AI-537,Delhi,Evening,one,Morning,Mumbai,Economy,115.83,1,15195,17-03-2018
301204,1300221,Vistara,UK-977,Delhi,Evening,zero,Night,Mumbai,Economy,622.25,1,15720,18-03-2018
301205,1300222,Vistara,UK-809,Delhi,Evening,one,Night,Mumbai,Economy,124.42,1,15983,19-03-2018

In [8]:
print(df)

        Unnamed: 0    airline   flight source_city departure_time stops  \
0                0   SpiceJet  SG-8709       Delhi        Evening  zero
1                1   SpiceJet  SG-8157       Delhi  Early_Morning  zero
2                2    AirAsia   I5-764       Delhi  Early_Morning  zero
3                3    Vistara   UK-995       Delhi        Morning  zero
4                4    Vistara   UK-963       Delhi        Morning  zero
...            ...        ...      ...         ...            ...   ...
301201     1300218    Vistara   UK-747       Delhi  Early_Morning   one
301202     1300219  Air_India   AI-512       Delhi      Afternoon   one
301203     1300220  Air_India   AI-537       Delhi        Evening   one
301204     1300221    Vistara   UK-977       Delhi        Evening  zero
301205     1300222    Vistara   UK-809       Delhi        Evening   one

         arrival_time destination_city    class  duration  days_left  price  \
0               Night           Mumbai  Economy      2.17          1   5953
1             Morning           Mumbai  Economy      2.33          1   5953
2       Early_Morning           Mumbai  Economy      2.17          1   5956
3           Afternoon           Mumbai  Economy      2.25          1   5955
4             Morning           Mumbai  Economy      2.33          1   5955
...               ...              ...      ...       ...        ...    ...
301201          Night           Mumbai  Economy    113.83          1  14985
301202          Night           Mumbai  Economy     97.58          1  14670
301203        Morning           Mumbai  Economy    115.83          1  15195
301204          Night           Mumbai  Economy    622.25          1  15720
301205          Night           Mumbai  Economy    124.42          1  15983

              date
0       01-01-2018
1       02-01-2018
2       03-01-2018
3       04-01-2018
4       05-01-2018
...            ...
301201  15-03-2018
301202  16-03-2018
301203  17-03-2018
301204  18-03-2018
301205  19-03-2018

[301206 rows x 13 columns]

In [9]:
print(df.isnull().sum())

Unnamed: 0               0
airline                452
flight                   0
source_city              0
departure_time           0
stops                    0
arrival_time             0
destination_city         0
class                  200
duration               250
days_left                0
price                  100
date                300848
dtype: int64

In [10]:
df.dropna(inplace=True)

In [11]:
df.shape

(358, 13)

In [12]:
df = df[df.notna().all(axis=1)]

In [13]:
df.shape

(358, 13)

In [14]:
df.describe()

         Unnamed: 0    duration   days_left
count  3.580000e+02  358.000000  358.000000
mean   1.853548e+05   15.386061    1.684358
std    4.550265e+05   36.694823    0.728246
min    0.000000e+00    2.000000    1.000000
25%    8.925000e+01    2.330000    1.000000
50%    1.785000e+02    9.165000    2.000000
75%    2.677500e+02   17.980000    2.000000
max    1.300222e+06  622.250000    3.000000

In [17]:
df.columns

Index(['Unnamed: 0', 'airline', 'flight', 'source_city', 'departure_time',
       'stops', 'arrival_time', 'destination_city', 'class', 'duration',
       'days_left', 'price', 'date'],
      dtype='object')

In [19]:
# check for duplicate rows
print(df.duplicated().sum())

0

In [20]:
df.drop_duplicates(inplace=True)

In [21]:
df

,Unnamed: 0,airline,flight,source_city,departure_time,stops,arrival_time,destination_city,class,duration,days_left,price,date
0,0,SpiceJet,SG-8709,Delhi,Evening,zero,Night,Mumbai,Economy,2.17,1,5953,01-01-2018
1,1,SpiceJet,SG-8157,Delhi,Early_Morning,zero,Morning,Mumbai,Economy,2.33,1,5953,02-01-2018
2,2,AirAsia,I5-764,Delhi,Early_Morning,zero,Early_Morning,Mumbai,Economy,2.17,1,5956,03-01-2018
3,3,Vistara,UK-995,Delhi,Morning,zero,Afternoon,Mumbai,Economy,2.25,1,5955,04-01-2018
4,4,Vistara,UK-963,Delhi,Morning,zero,Morning,Mumbai,Economy,2.33,1,5955,05-01-2018
...,...,...,...,...,...,...,...,...,...,...,...,...,...
301201,1300218,Vistara,UK-747,Delhi,Early_Morning,one,Night,Mumbai,Economy,113.83,1,14985,15-03-2018
301202,1300219,Air_India,AI-512,Delhi,Afternoon,one,Night,Mumbai,Economy,97.58,1,14670,16-03-2018
301203,1300220,Air_India,AI-537,Delhi,Evening,one,Morning,Mumbai,Economy,115.83,1,15195,17-03-2018
301204,1300221,Vistara,UK-977,Delhi,Evening,zero,Night,Mumbai,Economy,622.25,1,15720,18-03-2018
301205,1300222,Vistara,UK-809,Delhi,Evening,one,Night,Mumbai,Economy,124.42,1,15983,19-03-2018

In [22]:
df.drop(['Unnamed: 0'],axis=1,inplace = True)

In [23]:
df.head(2)

,airline,flight,source_city,departure_time,stops,arrival_time,destination_city,class,duration,days_left,price,date
0,SpiceJet,SG-8709,Delhi,Evening,zero,Night,Mumbai,Economy,2.17,1,5953,01-01-2018
1,SpiceJet,SG-8157,Delhi,Early_Morning,zero,Morning,Mumbai,Economy,2.33,1,5953,02-01-2018

In [26]:
df['price']=pd.to_numeric(df['price'],errors='coerce')

In [28]:
df

,airline,flight,source_city,departure_time,stops,arrival_time,destination_city,class,duration,days_left,price,date
0,SpiceJet,SG-8709,Delhi,Evening,zero,Night,Mumbai,Economy,2.17,1,5953,01-01-2018
1,SpiceJet,SG-8157,Delhi,Early_Morning,zero,Morning,Mumbai,Economy,2.33,1,5953,02-01-2018
2,AirAsia,I5-764,Delhi,Early_Morning,zero,Early_Morning,Mumbai,Economy,2.17,1,5956,03-01-2018
3,Vistara,UK-995,Delhi,Morning,zero,Afternoon,Mumbai,Economy,2.25,1,5955,04-01-2018
4,Vistara,UK-963,Delhi,Morning,zero,Morning,Mumbai,Economy,2.33,1,5955,05-01-2018
...,...,...,...,...,...,...,...,...,...,...,...,...
301201,Vistara,UK-747,Delhi,Early_Morning,one,Night,Mumbai,Economy,113.83,1,14985,15-03-2018
301202,Air_India,AI-512,Delhi,Afternoon,one,Night,Mumbai,Economy,97.58,1,14670,16-03-2018
301203,Air_India,AI-537,Delhi,Evening,one,Morning,Mumbai,Economy,115.83,1,15195,17-03-2018
301204,Vistara,UK-977,Delhi,Evening,zero,Night,Mumbai,Economy,622.25,1,15720,18-03-2018
301205,Vistara,UK-809,Delhi,Evening,one,Night,Mumbai,Economy,124.42,1,15983,19-03-2018

In [29]:
df['arrival_time']=df['arrival_time'].str.replace('Early_Morning','Morning')

In [31]:
df['arrival_time'].unique()

array(['Night', 'Morning', 'Afternoon', 'Evening', 'Late_Night'],
      dtype=object)

In [32]:
df['arrival_time']=df['arrival_time'].str.replace('Late_Night','Night')

In [33]:
df['arrival_time'].unique()

array(['Night', 'Morning', 'Afternoon', 'Evening'], dtype=object)

In [34]:
df['airline'].unique()

array(['SpiceJet', 'AirAsia', 'Vistara', 'GO_FIRST', 'Indigo',
       'Air_India'], dtype=object)

In [35]:
df['class'].unique()

array(['Economy'], dtype=object)

In [36]:
df['departure_time'].unique()

array(['Evening', 'Early_Morning', 'Morning', 'Afternoon', 'Night'],
      dtype=object)

In [37]:
df['departure_time']=df['departure_time'].str.replace('Early_Morning','Morning')

In [38]:
df['departure_time'].unique()

array(['Evening', 'Morning', 'Afternoon', 'Night'], dtype=object)

In [39]:
df['destination_city'].unique()

array(['Mumbai'], dtype=object)

In [40]:
df['source_city'].unique()

array(['Delhi'], dtype=object)

In [41]:
df

,airline,flight,source_city,departure_time,stops,arrival_time,destination_city,class,duration,days_left,price,date
0,SpiceJet,SG-8709,Delhi,Evening,zero,Night,Mumbai,Economy,2.17,1,5953,01-01-2018
1,SpiceJet,SG-8157,Delhi,Morning,zero,Morning,Mumbai,Economy,2.33,1,5953,02-01-2018
2,AirAsia,I5-764,Delhi,Morning,zero,Morning,Mumbai,Economy,2.17,1,5956,03-01-2018
3,Vistara,UK-995,Delhi,Morning,zero,Afternoon,Mumbai,Economy,2.25,1,5955,04-01-2018
4,Vistara,UK-963,Delhi,Morning,zero,Morning,Mumbai,Economy,2.33,1,5955,05-01-2018
...,...,...,...,...,...,...,...,...,...,...,...,...
301201,Vistara,UK-747,Delhi,Morning,one,Night,Mumbai,Economy,113.83,1,14985,15-03-2018
301202,Air_India,AI-512,Delhi,Afternoon,one,Night,Mumbai,Economy,97.58,1,14670,16-03-2018
301203,Air_India,AI-537,Delhi,Evening,one,Morning,Mumbai,Economy,115.83,1,15195,17-03-2018
301204,Vistara,UK-977,Delhi,Evening,zero,Night,Mumbai,Economy,622.25,1,15720,18-03-2018
301205,Vistara,UK-809,Delhi,Evening,one,Night,Mumbai,Economy,124.42,1,15983,19-03-2018

In [ ]:
df['airline'] = df['airline'].str.strip().str.title()

In [43]:
df['airline'].unique()

array(['Spicejet', 'Airasia', 'Vistara', 'Go_First', 'Indigo',
       'Air_India'], dtype=object)

In [44]:
df['airline'] = df['airline'].str.replace('Go_First','Go First')

In [45]:
df['airline'].unique()

array(['Spicejet', 'Airasia', 'Vistara', 'Go First', 'Indigo',
       'Air_India'], dtype=object)

In [46]:
df['airline'] = df['airline'].str.replace('Air_India','Air India')

In [47]:
df['airline'].unique()

array(['Spicejet', 'Airasia', 'Vistara', 'Go First', 'Indigo',
       'Air India'], dtype=object)

In [51]:
file=r"D:\EXCELL\Flight_Data.csv"
df.to_csv(file, encoding = 'unicode_escape')

##SAVED THE CLEANED DATA